app/views/students/index.html.erb

SELECT "houses".* FROM "houses" WHERE "houses"."id" = $1 LIMIT 1  [["id", 21]]
---
  <div>
    <%= link_to "#{student.name}", student_path(student) %> - <%= Houses.find(student.house_id).name %>