app/controllers/houses_controller.rb

SELECT "houses".* FROM "houses"
---
  def index
    @houses = Houses.all

SELECT "houses".* FROM "houses" WHERE "houses"."id" = $1 LIMIT 1  [["id", "21"]]
SELECT "students".* FROM "students" WHERE "students"."houses_id" = $1  [[nil, 21]]
---
  def show
    @house = Houses.find(params[:id])
    @students = Student.where("house_id = #{@house.id}")