app/controllers/students_controller.rb

SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT 1  [["id", :id]]
SELECT "houses".* FROM "houses" WHERE "houses"."id" = $1 LIMIT 1  [["id", 21]]
---
  def show
    @student = Student.find(params[:id])
    @house = Houses.find(@student.house_id)

SELECT "houses".* FROM "houses"
INSERT INTO "students" ("created_at", "house_id", "img_url", "name", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Tue, 20 Dec 2016 00:48:51 UTC +00:00], ["house_id", 24], ["img_url", ""], ["name", "Margaret Ha"], ["updated_at", Tue, 20 Dec 2016 00:48:51 UTC +00:00]]
---
  def create
    student_params = params.require(:student).permit(:name, :img_url)
    house = Houses.all.sample
    @student = Student.new(student_params)
    @student[:house_id] = house.id
    if @student.save